[{"author":null,"categories":null,"content":"2025 was a year of pressure, complexity, and real growth for me. Rather than following a linear or comfortable path, I navigated multiple systems simultaneously—academics, immigration constraints, early-career positioning, and cross-border decisions. While this came with anxiety and uncertainty, it also forced me to develop resilience, structure, and professional clarity. By the end of 2025, I am no longer “exploring aimlessly,” but operating with a defined skill set in finance, data, and research, and with a clearer understanding of how global systems function.\nImportantly, 2025 taught me that effort alone is not enough—strategy and sequencing matter more than intensity.\n","date":1766793600,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":100,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1766793600,"objectID":"4755088938d26940cdd1d7b14ffb9599","permalink":"https://ashleyzhiyin.github.io/post/2025reflection/","publishdate":"2025-12-27T00:00:00Z","readingtime":1,"relpermalink":"/post/2025reflection/","section":"post","tags":null,"title":"2025 Reflection","type":"post","url":"/post/2025reflection/","weight":0,"wordcount":99},{"author":null,"categories":null,"content":"Hi there 🍀 Zhiyin Zhang Hi, I’m Zhiyin(Ashley) Zhang. I am a future asset analyst with quantitative insights to support investment decisions.\nCareer Focus Asset/risk management Currently exploring opportunities in Hong Kong / Singapore / US buy-side firms Experience Equity Analyst Intern: World Quant Brain (Singapore) Equity Analyst Intern: China International Capital Corporation Limited (China Shanghai) Investment Member: Wharton PE/VC Club ｜ Wharton Chinese Association (US PA) Education Social Policy in Economic Track (M.S) | University ofPennsylvania Computer Science (M.S) | Northern Arizona University Applied Linguistic (B.A) | Wuhan University Skills Investment research \u0026amp;amp; asset allocation (Equity / Multi-asset / ETFs / Alternatives) Quantitative modeling: time-series analysis, risk modelling (VaR / GARCH), forecasting Corporate valuation \u0026amp;amp; financial modeling (DCF, comparable analysis, capital budgeting) Data-driven decision-making in finance (econometrics, optimization, …","date":1764607020,"dir":"/","expirydate":-62135596800,"fuzzywordcount":200,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1764607020,"objectID":"6083a88ee3411b0d17ce02d738f69d47","permalink":"https://ashleyzhiyin.github.io/about/","publishdate":"2025-12-02T00:37:00+08:00","readingtime":1,"relpermalink":"/about/","section":"","tags":null,"title":"About","type":"page","url":"/about/","weight":0,"wordcount":147},{"author":null,"categories":null,"content":"Grateful to Singapore and CPGFM for Giving Me a New Lease on Life\nThe past six months in Singapore have marked a fresh start in my life, and I’m deeply grateful for the support from CPG Facilities Management Pte Ltd (CPG FM).\nI discovered my career path. Thanks to the leaders and colleagues I’ve met, I’ve received respect and valuable guidance in the workplace. They taught me essential business skills, as well as effective communication and collaboration techniques. I applied my policy analysis and data analytics skills in the industry and also took the initiative to learn foundational finance and accounting knowledge to broaden my expertise.\nI also participated in business consulting cases and finance competitions, teaming up with outstanding peers from diverse backgrounds. Through these experiences, I learned how to collaborate effectively and work as part of a team.\nBeyond work, I cultivated stable and meaningful hobbies. During this time, I completed 11 ballet classes, 15 street …","date":1764606422,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":200,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1764606422,"objectID":"2428ec7a948d62d1e37f65fbab8a7988","permalink":"https://ashleyzhiyin.github.io/post/test/","publishdate":"2025-12-02T00:27:02+08:00","readingtime":1,"relpermalink":"/post/test/","section":"post","tags":null,"title":"Life at CPGFM","type":"post","url":"/post/test/","weight":0,"wordcount":199},{"author":null,"categories":null,"content":"Back to Ewha Womans University 이화여자대학교, where I once joined a summer exchange program and connected with students and faculty worldwide. ❣️\nIn sociology courses, we explored key issues like hakwon (supplementary education), gender roles, and economic development. For the final paper, I combined data analysis and interviews to study how gender shapes attitudes toward marriage and childbearing in South Korea.\nGrateful for the opportunity to deepen my understanding of East Asian societies through both academic and cross-cultural experiences. Looking forward to applying these insights to my future work in policy analysis and social research.\n","date":1748995200,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":200,"html":null,"keywords":null,"kind":"page","lang":"en","lastmod":1748995200,"objectID":"44c24b8c81a08ce98a211bbc2c676451","permalink":"https://ashleyzhiyin.github.io/post/cpgfm/","publishdate":"2025-06-04T00:00:00Z","readingtime":1,"relpermalink":"/post/cpgfm/","section":"post","tags":null,"title":"Back to Ewha Womans University","type":"post","url":"/post/cpgfm/","weight":0,"wordcount":103}]